docs/loader.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My GNU Emacs configuration</title>
<!-- 2017-06-24 Sat 17:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kohei Kawasaki" />
<meta  name="description" content="Loading emacs configuration using org-babel"
 />
</head>
<body>
<div id="content">
<h1 class="title">My GNU Emacs configuration</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
この設定は、<a href="https://gitlab.com/buildfunthings/emacs-config">buildfunthings/emacs-config</a> をベースにしています。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name "Kohei Kawasaki")
(setq user-mail-address "mynameiskawasaq@gmail.com")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">基本的なキーの変更</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">C-h をバックスペースにする</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key "\C-h" 'delete-backward-char)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Meta+方向で window を移動できるようにする</h3>
<div class="outline-text-3" id="text-2-2">
<p>
ただし org-mode を除く。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "M-&lt;left&gt;")  'windmove-left)
(global-set-key (kbd "M-&lt;right&gt;") 'windmove-right)
(global-set-key (kbd "M-&lt;up&gt;")    'windmove-up)
(global-set-key (kbd "M-&lt;down&gt;")  'windmove-down)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Mac 固有の設定</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">Command とスペースで入力切替が起こる設定を無効にする</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Emacs の設定ではなく、Mac 側の設定を変更する必要がある。
</p>

<ol class="org-ol">
<li>システム設定画面からキーボードを選択する。
</li>
<li>ショートカットのタブを選択する。
</li>
<li>「入力ソース」の設定のところに、コマンドキーとスペースキーを組み合わせたショートカットが登録されているので、これを無効にする。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">Mac OS の Command キーと Option キーの挙動を変更する</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Command キーをメタキーに、Optionキーを無効に変更する
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="credmp-keys">(setq mac-option-modifier 'none)
(setq mac-command-modifier 'meta)
(setq ns-function-modifier 'hyper)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3">yes/no の代わりに y/n で答えられるようにする</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">パッケージごとの設定</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">use-package をインストールする</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(require 'diminish)
(require 'bind-key)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">swiper</h3>
<div class="outline-text-3" id="text-3-2">
<p>
使い方とかはここを見る。
</p>

<ul class="org-ul">
<li><a href="https://github.com/abo-abo/swiper">https://github.com/abo-abo/swiper</a>
</li>
<li><a href="https://www.youtube.com/watch?v=VvnJQpTFVDc">https://www.youtube.com/watch?v=VvnJQpTFVDc</a>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package ivy
  :ensure t
  :bind
  (("M-x" . counsel-M-x)
   ("M-y" . counsel-yank-pop)
   ("C-s" . swiper)
   ("C-c C-r" . ivy-resume)
   ("C-x C-f" . counsel-find-file)
   ("C-c h f" . counsel-describe-function)
   ("C-c h v" . counsel-describe-variable)
   ("C-c i u" . counsel-unicode-char)
   ("M-i" . counsel-imenu)
   ("C-c g" . counsel-git)
   ("C-c j" . counsel-git-grep)
   ("C-c k" . counsel-ag)
   ("C-c l" . scounsel-locate)
   ("C-x b" . ivy-switch-buffer)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">magit</h3>
<div class="outline-text-3" id="text-3-3">
<p>
C-c m で magit-status を実行する。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package magit
    :ensure t
    :bind
    (("C-c m" . magit-status)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">細々としたモード</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package yaml-mode)
(use-package json-mode)
(use-package terraform-mode)
(use-package markdown-mode :ensure t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Look and feel</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">カラーテーマ</h3>
<div class="outline-text-3" id="text-4-1">
<p>
base16 のテーマを設定する
<a href="https://github.com/chriskempson/base16">https://github.com/chriskempson/base16</a>
<a href="https://github.com/stepchowfun/base16-circus-scheme">https://github.com/stepchowfun/base16-circus-scheme</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(use-package base16-theme
  :ensure t
  :config
  (load-theme 'base16-circus t))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">常に行番号を表示する</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-linum-mode t)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kohei Kawasaki</p>
<p class="date">Created: 2017-06-24 Sat 17:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
